Revit 2024 API
MultiReferenceAnnotationOptions.TagHeadPosition Property
 The position for the tag's head.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public XYZ TagHeadPosition { get; set; }
Visual Basic
Public Property TagHeadPosition As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ TagHeadPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
MultiReferenceAnnotationOptions Class
Autodesk.Revit.DB Namespace